УчетВУправляющихДляГит1/src/InformationRegisters/НастройкиПолученияЭлектронныхДокументов/НастройкиПолученияЭлектронныхДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НастройкиПолученияЭлектронныхДокументов</name>
  <resources>
    <name>СпособОбработки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </resources>
  <attributes>
    <name>НеПредлагатьСохранятьНастройки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>Получатель</name>
    <type>
      <types>DefinedType.Организация</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Отправитель</name>
    <type>
      <types>DefinedType.КонтрагентБЭД</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИдентификаторОтправителя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>70</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ИдентификаторПолучателя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>70</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидДокумента</name>
    <type>
      <types>EnumRef.ВидыЭД</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПрикладнойВидЭД</name>
    <type>
      <types>DefinedType.ПрикладныеВидыЭлектронныхДокументов</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УчетВУправляющихДляГит1/src/InformationRegisters/НастройкиПолученияЭлектронныхДокументов/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

// Удаляет настройки отправки ЭДО
// 
//  Параметры - СписокЗначений - параметры учетной записи для удаления
//  АдресРезультата - Строка - путь временного хранилища
//
Процедура УдалитьНастройкиОтраженияЭДО(Параметры, АдресРезультата) Экспорт
	
	Организация              = Неопределено;
	Контрагент               = Неопределено;
	ИдентификаторКонтрагента = Неопределено;
	ИдентификаторОрганизации = Неопределено;
	Результат                = Истина;
	
	Параметры.Свойство("Организация"             , Организация);
	Параметры.Свойство("Контрагент"              , Контрагент);
	Параметры.Свойство("ИдентификаторОрганизации", ИдентификаторОрганизации);
	Параметры.Свойство("ИдентификаторКонтрагента", ИдентификаторКонтрагента);
	
	НаборЗаписей = РегистрыСведений.НастройкиПолученияЭлектронныхДокументов.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Отправитель.Установить(Контрагент);
	НаборЗаписей.Отбор.Получатель.Установить(Организация);
	
	Если ЗначениеЗаполнено(ИдентификаторОрганизации) Тогда
		НаборЗаписей.Отбор.ИдентификаторПолучателя.Установить(ИдентификаторОрганизации);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ИдентификаторКонтрагента) Тогда
		НаборЗаписей.Отбор.ИдентификаторОтправителя.Установить(ИдентификаторКонтрагента);
	КонецЕсли;
	
	НачатьТранзакцию();
	
	Попытка
		// Попытка удаления. Управляемую блокировку устанавливать нет необходимости.
		НаборЗаписей.Записать();
		
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		
		Информация = ИнформацияОбОшибке();
		
		ТекстОшибки = СтрШаблон(НСтр("ru = 'Не удалось удалить настройки отправки по:
                                      |Организация: %1,
                                      |Контрагент: %2,
                                      |Идентификатор организации: %3.
                                      |Идентификатор контрагента: %4'"), Организация, Контрагент, ИдентификаторОрганизации, ИдентификаторКонтрагента);
		
		ЭлектронноеВзаимодействие.ОбработатьОшибку(НСтр("ru = 'Удаление настроек отражения в учете ЭДО'"), ПодробноеПредставлениеОшибки(Информация), ТекстОшибки);
		Результат = Ложь;
		
	КонецПопытки;
	
	ПоместитьВоВременноеХранилище(Результат, АдресРезультата);
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
